
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <title>概述 - 分布式 Java(Distributed Java) - 开源图书(OpenBooks)</title>
        
        <meta name="description" content="">
        
        
        <script data-ad-client="ca-pub-9312750344484857" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
        
    
    <link rel="stylesheet" href="//cdn.jsdelivr.net/npm/gitbook-plugin-theme-default@1.0.7/_assets/website/style.css">

    
            
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="//cdn.jsdelivr.net/npm/gitbook-plugin-theme-default@1.0.7/_assets/website/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="//cdn.jsdelivr.net/npm/gitbook-plugin-theme-default@1.0.7/_assets/website/images/favicon.ico" type="image/x-icon">

    <link rel="next" href="jms.html" />
    

    </head>
    <body>
        
<div class="book">  
    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
	<a href="/" class="btn pull-left" aria-label="开源图书(OpenBooks)"><i class="fa fa-home"></i></a>
    

    <!-- Title -->
    <h1><i class="fa fa-circle-o-notch fa-spin"></i><a href=".." >概述</a></h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <ins class="adsbygoogle"
                                     style="display:block"
                                     data-ad-client="ca-pub-9312750344484857"
                                     data-ad-slot="2669241897"
                                     data-ad-format="auto"
                                     data-full-width-responsive="true"></ins>
                                <script>
                                     (adsbygoogle = window.adsbygoogle || []).push({});
                                </script>
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x6982;&#x8FF0;">&#x6982;&#x8FF0;</h1>
<p>&#x9762;&#x5411;&#x6D88;&#x606F;&#x7684;&#x4E2D;&#x95F4;&#x4EF6;&#xFF08;MOM&#xFF09;&#x6216;&#x8005;&#x6D88;&#x606F;&#x961F;&#x5217;&#xFF08;MQ&#xFF09;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x4EE5;&#x677E;&#x6563;&#x8026;&#x5408;&#x7684;&#x7075;&#x6D3B;&#x65B9;&#x5F0F;&#x96C6;&#x6210;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x4E00;&#x79CD;&#x673A;&#x5236;&#x3002;&#x5B83;&#x4EEC;&#x63D0;&#x4F9B;&#x4E86;&#x57FA;&#x4E8E;&#x5B58;&#x50A8;&#x548C;&#x8F6C;&#x53D1;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E4B;&#x95F4;&#x7684;&#x5F02;&#x6B65;&#x6570;&#x636E;&#x53D1;&#x9001;&#xFF0C;&#x5373;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F7C;&#x6B64;&#x4E0D;&#x76F4;&#x63A5;&#x901A;&#x4FE1;&#xFF0C;&#x800C;&#x662F;&#x4E0E;&#x4F5C;&#x4E3A;&#x4E2D;&#x4ECB;&#x7684; MOM &#x901A;&#x4FE1;&#x3002;MOM &#x63D0;&#x4F9B;&#x4E86;&#x6709;&#x4FDD;&#x8BC1;&#x7684;&#x6D88;&#x606F;&#x53D1;&#x9001;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x65E0;&#x9700;&#x4E86;&#x89E3;&#x8FDC;&#x7A0B;&#x8FC7;&#x7A0B;&#x8C03;&#x7528;&#xFF08;PRC&#xFF09;&#x548C;&#x7F51;&#x7EDC;/&#x901A;&#x4FE1;&#x534F;&#x8BAE;&#x7684;&#x7EC6;&#x8282;&#x3002;</p>
<h2 id="&#x6D88;&#x606F;&#x4E2D;&#x95F4;&#x4EF6;&#x7B80;&#x4ECB;">&#x6D88;&#x606F;&#x4E2D;&#x95F4;&#x4EF6;&#x7B80;&#x4ECB;</h2>
<p>&#x8FDC;&#x7A0B;&#x8FC7;&#x7A0B;&#x8C03;&#x7528;&#x6709;&#x52A9;&#x4E8E;&#x9690;&#x85CF;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x901A;&#x4FE1;&#x7EC6;&#x8282;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x589E;&#x5F3A;&#x4E86;&#x8BBF;&#x95EE;&#x900F;&#x660E;&#x6027;&#x3002;&#x4F46;&#x8FD9;&#x79CD;&#x673A;&#x5236;&#x5E76;&#x4E0D;&#x4E00;&#x5B9A;&#x9002;&#x5408;&#x6240;&#x6709;&#x573A;&#x666F;&#x3002;&#x7279;&#x522B;&#x662F;&#x5F53;&#x65E0;&#x6CD5;&#x4FDD;&#x8BC1;&#x53D1;&#x51FA;&#x8BF7;&#x6C42;&#x65F6;&#x63A5;&#x6536;&#x7AEF;&#x4E00;&#x5B9A;&#x6B63;&#x5728;&#x6267;&#x884C;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5C31;&#x5FC5;&#x987B;&#x6709;&#x5176;&#x4ED6;&#x7684;&#x901A;&#x4FE1;&#x670D;&#x52A1;&#x3002;&#x540C;&#x65F6; RPC &#x7684;&#x540C;&#x6B65;&#x7279;&#x6027;&#x4E5F;&#x4F1A;&#x9020;&#x6210;&#x5BA2;&#x6237;&#x5728;&#x53D1;&#x51FA;&#x8BF7;&#x6C42;&#x5F97;&#x5230;&#x5904;&#x7406;&#x4E4B;&#x524D;&#x88AB;&#x963B;&#x585E;&#x4E86;&#xFF0C;&#x56E0;&#x800C;&#x6709;&#x65F6;&#x4E5F;&#x9700;&#x8981;&#x91C7;&#x53D6;&#x5176;&#x4ED6;&#x7684;&#x529E;&#x6CD5;&#x3002;&#x800C;&#x9762;&#x5411;&#x6D88;&#x606F;&#x7684;&#x901A;&#x4FE1;&#x5C31;&#x662F;&#x89E3;&#x51B3;&#x4E86;&#x4E0A;&#x9762;&#x63D0;&#x5230;&#x7684;&#x79CD;&#x79CD;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x9762;&#x5411;&#x6D88;&#x606F;&#x7684;&#x901A;&#x4FE1;&#x4E00;&#x822C;&#x662F;&#x7531;&#x6D88;&#x606F;&#x961F;&#x5217;&#x7CFB;&#x7EDF;&#xFF08;Message-Queuing System&#xFF0C;MQ&#xFF09;&#x6216;&#x8005;&#x9762;&#x5411;&#x6D88;&#x606F;&#x4E2D;&#x95F4;&#x4EF6;( Message-Oriented Middleware&#xFF0C;MOM)&#x6765;&#x63D0;&#x4F9B;&#x9AD8;&#x6548;&#x53EF;&#x9760;&#x7684;&#x6D88;&#x606F;&#x4F20;&#x9012;&#x673A;&#x5236;&#x8FDB;&#x884C;&#x5E73;&#x53F0;&#x65E0;&#x5173;&#x7684;&#x6570;&#x636E;&#x4EA4;&#x6D41;&#xFF0C;&#x5E76;&#x53EF;&#x57FA;&#x4E8E;&#x6570;&#x636E;&#x901A;&#x4FE1;&#x8FDB;&#x884C;&#x5206;&#x5E03;&#x7CFB;&#x7EDF;&#x7684;&#x96C6;&#x6210;&#x3002;&#x901A;&#x8FC7;&#x63D0;&#x4F9B;&#x6D88;&#x606F;&#x4F20;&#x9012;&#x548C;&#x6D88;&#x606F;&#x6392;&#x961F;&#x6A21;&#x578B;&#xFF0C;&#x53EF;&#x5728;&#x5206;&#x5E03;&#x73AF;&#x5883;&#x4E0B;&#x6269;&#x5C55;&#x8FDB;&#x7A0B;&#x95F4;&#x7684;&#x901A;&#x4FE1;&#xFF0C;&#x5E76;&#x652F;&#x6301;&#x591A;&#x79CD;&#x901A;&#x8BBD;&#x534F;&#x8BAE;&#x3001;&#x8BED;&#x8A00;&#x3001;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3001;&#x786C;&#x4EF6;&#x548C;&#x8F6F;&#x4EF6;&#x5E73;&#x53F0;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x4F7F;&#x7528; MQ &#x6216;&#x8005; MOM&#xFF0C;&#x901A;&#x4FE1;&#x53CC;&#x65B9;&#x7684;&#x7A0B;&#x5E8F;&#xFF08;&#x79F0;&#x5176;&#x4E3A;&#x6D88;&#x606F;&#x5BA2;&#x6237;&#x7A0B;&#x5E8F;&#xFF09;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x65F6;&#x95F4;&#x8FD0;&#x884C;&#xFF0C;&#x7A0B;&#x5E8F;&#x4E0D;&#x5728;&#x7F51;&#x7EDC;&#x4E0A;&#x76F4;&#x63A5;&#x901A;&#x8BDD;&#xFF0C;&#x800C;&#x662F;&#x95F4;&#x63A5;&#x5730;&#x5C06;&#x6D88;&#x606F;&#x653E;&#x5165; MQ &#x6216;&#x8005; MOM &#x670D;&#x52A1;&#x5668;&#x7684;&#x6D88;&#x606F;&#x673A;&#x5236;&#x4E2D;&#x3002;&#x56E0;&#x4E3A;&#x7A0B;&#x5E8F;&#x95F4;&#x6CA1;&#x6709;&#x76F4;&#x63A5;&#x7684;&#x8054;&#x7CFB;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x4EEC;&#x4E0D;&#x5FC5;&#x540C;&#x65F6;&#x8FD0;&#x884C;&#xFF1A;&#x6D88;&#x606F;&#x653E;&#x5165;&#x9002;&#x5F53;&#x7684;&#x961F;&#x5217;&#x65F6;&#xFF0C;&#x76EE;&#x6807;&#x7A0B;&#x5E8F;&#x4E0D;&#x9700;&#x8981;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#xFF1B;&#x5373;&#x4F7F;&#x76EE;&#x6807;&#x7A0B;&#x5E8F;&#x5728;&#x8FD0;&#x884C;&#xFF0C;&#x4E5F;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x8981;&#x7ACB;&#x5373;&#x5904;&#x7406;&#x8BE5;&#x6D88;&#x606F;&#x3002; </p>
<p>&#x6D88;&#x606F;&#x5BA2;&#x6237;&#x7A0B;&#x5E8F;&#x4E4B;&#x95F4;&#x901A;&#x8FC7;&#x5C06;&#x6D88;&#x606F;&#x653E;&#x5165;&#x6D88;&#x606F;&#x961F;&#x5217;&#x6216;&#x4ECE;&#x6D88;&#x606F;&#x961F;&#x5217;&#x4E2D;&#x53D6;&#x51FA;&#x6D88;&#x606F;&#x6765;&#x8FDB;&#x884C;&#x901A;&#x8BAF;&#x3002;&#x5BA2;&#x6237;&#x7A0B;&#x5E8F;&#x4E0D;&#x76F4;&#x63A5;&#x4E0E;&#x5176;&#x4ED6;&#x7A0B;&#x5E8F;&#x901A;&#x4FE1;&#xFF0C;&#x907F;&#x514D;&#x4E86;&#x7F51;&#x7EDC;&#x901A;&#x8BAF;&#x7684;&#x590D;&#x6742;&#x6027;&#x3002;&#x6D88;&#x606F;&#x961F;&#x5217;&#x548C;&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#x7684;&#x7EF4;&#x62A4;&#x5DE5;&#x4F5C;&#x7531; MQ &#x6216;&#x8005; MOM &#x5B8C;&#x6210;&#x3002;</p>
<p>&#x5E38;&#x89C1;&#x7684; MQ &#x6216;&#x8005; MOM &#x4EA7;&#x54C1;&#x6709; Java Message Service&#x3001;Apache ActiveMQ&#x3001;RocketMQ&#x3001;RabbitMQ&#x3001;Apache Kafka &#x7B49;&#x3002;</p>
<h2 id="&#x6D88;&#x606F;&#x4E2D;&#x95F4;&#x4EF6;&#x4F18;&#x70B9;">&#x6D88;&#x606F;&#x4E2D;&#x95F4;&#x4EF6;&#x4F18;&#x70B9;</h2>
<p>&#x6D88;&#x606F;&#x4E2D;&#x95F4;&#x4EF6;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x4E2D;&#x95F4;&#x5C42;&#x8F6F;&#x4EF6;&#xFF0C;&#x5B83;&#x4E3A;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#x521B;&#x5EFA;&#x3001;&#x53D1;&#x9001;&#x3001;&#x63A5;&#x6536;&#x6D88;&#x606F;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x5957;&#x53EF;&#x9760;&#x901A;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5B9E;&#x73B0;&#x4E86;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#x53EF;&#x9760;&#x7684;&#x3001;&#x9AD8;&#x6548;&#x7684;&#x3001;&#x5B9E;&#x65F6;&#x7684;&#x8DE8;&#x5E73;&#x53F0;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x3002;&#x6D88;&#x606F;&#x4E2D;&#x95F4;&#x4EF6;&#x51CF;&#x5C11;&#x4E86;&#x5F00;&#x53D1;&#x8DE8;&#x5E73;&#x53F0;&#x548C;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#x8F6F;&#x4EF6;&#x7684;&#x590D;&#x6742;&#x6027;&#xFF0C;&#x5B83;&#x5C4F;&#x853D;&#x4E86;&#x4E0D;&#x540C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x548C;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#x7684;&#x5177;&#x4F53;&#x7EC6;&#x8282;&#xFF0C;&#x9762;&#x5BF9;&#x89C4;&#x6A21;&#x548C;&#x590D;&#x6742;&#x5EA6;&#x90FD;&#x8D8A;&#x6765;&#x8D8A;&#x9AD8;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#xFF0C;&#x6D88;&#x606F;&#x4E2D;&#x95F4;&#x4EF6;&#x6280;&#x672F;&#x663E;&#x793A;&#x51FA;&#x4E86;&#x5B83;&#x7684;&#x4F18;&#x8D8A;&#x6027;&#xFF1A;</p>
<ol>
<li>&#x91C7;&#x7528;&#x5F02;&#x6B65;&#x901A;&#x4FE1;&#x6A21;&#x5F0F;&#xFF1A;&#x53D1;&#x9001;&#x6D88;&#x606F;&#x8005;&#x53EF;&#x4EE5;&#x5728;&#x53D1;&#x9001;&#x6D88;&#x606F;&#x540E;&#x8FDB;&#x884C;&#x5176;&#x5B83;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x4E0D;&#x7528;&#x7B49;&#x5F85;&#x63A5;&#x6536;&#x8005;&#x7684;&#x56DE;&#x5E94;&#xFF0C;&#x800C;&#x63A5;&#x6536;&#x8005;&#x4E5F;&#x4E0D;&#x5FC5;&#x5728;&#x63A5;&#x5230;&#x6D88;&#x606F;&#x540E;&#x7ACB;&#x5373;&#x5BF9;&#x53D1;&#x9001;&#x8005;&#x7684;&#x8BF7;&#x6C42;&#x8FDB;&#x884C;&#x5904;&#x7406;&#xFF1B;</li>
<li>&#x5BA2;&#x6237;&#x548C;&#x670D;&#x52A1;&#x5BF9;&#x8C61;&#x751F;&#x547D;&#x5468;&#x671F;&#x7684;&#x677E;&#x8026;&#x5408;&#x5173;&#x7CFB;&#xFF1A;&#x5BA2;&#x6237;&#x8FDB;&#x7A0B;&#x548C;&#x670D;&#x52A1;&#x5BF9;&#x8C61;&#x8FDB;&#x7A0B;&#x4E0D;&#x8981;&#x6C42;&#x90FD;&#x6B63;&#x5E38;&#x8FD0;&#x884C;&#xFF0C;&#x5982;&#x679C;&#x7531;&#x4E8E;&#x670D;&#x52A1;&#x5BF9;&#x8C61;&#x5D29;&#x6E83;&#x6216;&#x8005;&#x7F51;&#x7EDC;&#x6545;&#x969C;&#x5BFC;&#x81F4;&#x5BA2;&#x6237;&#x7684;&#x8BF7;&#x6C42;&#x4E0D;&#x53EF;&#x8FBE;&#xFF0C;&#x5BA2;&#x6237;&#x4E0D;&#x4F1A;&#x63A5;&#x6536;&#x5230;&#x5F02;&#x5E38;&#xFF0C;&#x6D88;&#x606F;&#x4E2D;&#x95F4;&#x4EF6;&#x80FD;&#x4FDD;&#x8BC1;&#x6D88;&#x606F;&#x4E0D;&#x4F1A;&#x4E22;&#x5931;&#x3002;</li>
</ol>

                                
                                </section>
                                <ins class="adsbygoogle"
                                     style="display:block"
                                     data-ad-client="ca-pub-9312750344484857"
                                     data-ad-slot="2669241897"
                                     data-ad-format="auto"
                                     data-full-width-responsive="true"></ins>
                                <script>
                                     (adsbygoogle = window.adsbygoogle || []).push({});
                                </script>                                
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
                <a href="jms.html" class="navigation navigation-next navigation-unique" aria-label="下一页: JMS">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            <a href="../">
            
                    
                    简介
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="basic.html">
            <a href="basic.html">
            
                    
                    基础概念
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    通信原理
            </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="ipc.html">
            <a href="ipc.html">
            
                    
                    IPC
            </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    网络通信基础
            </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="net-overview.html">
            <a href="net-overview.html">
            
                    
                    概述
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="socket.html">
            <a href="socket.html">
            
                    
                    Socket
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="bio.html">
            <a href="bio.html">
            
                    
                    BIO
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="nio.html">
            <a href="nio.html">
            
                    
                    NIO
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.5" data-path="aio.html">
            <a href="aio.html">
            
                    
                    AIO
            </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" >
            
                <span>
            
                    
                    分布式对象 Java RMI
            </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="rmi-overview.html">
            <a href="rmi-overview.html">
            
                    
                    概述
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="architecture.html">
            <a href="architecture.html">
            
                    
                    架构
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3" data-path="api.html">
            <a href="api.html">
            
                    
                    常用接口
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.4" data-path="example.html">
            <a href="example.html">
            
                    
                    示例
            </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" >
            
                <span>
            
                    
                    基于消息的通信
            </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.6.1" data-path="mq-overview.html">
            <a href="mq-overview.html">
            
                    
                    概述
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.2" data-path="jms.html">
            <a href="jms.html">
            
                    
                    JMS
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.3" data-path="actiovemq.html">
            <a href="actiovemq.html">
            
                    
                    ActiveMQ 示例
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.4" data-path="mq-other.html">
            <a href="mq-other.html">
            
                    
                    其他
            </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.7" >
            
                <span>
            
                    
                    Web Services
            </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.7.1" data-path="web-overview.html">
            <a href="web-overview.html">
            
                    
                    概述
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.2" data-path="jax-ws.html">
            <a href="jax-ws.html">
            
                    
                    JAX-WS
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.3" data-path="rest.html">
            <a href="rest.html">
            
                    
                    RESTful 概述
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.4" data-path="jersey.html">
            <a href="jersey.html">
            
                    
                    基于 Jersey 的 JAX-RS 示例 
            </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.8" >
            
                <span>
            
                    
                    微服务
            </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.8.1" data-path="mas-overview.html">
            <a href="mas-overview.html">
            
                    
                    概述
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8.2" data-path="spring-boot.html">
            <a href="spring-boot.html">
            
                    
                    Spring Boot
            </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.9" >
            
                <span>
            
                    
                    监控
            </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.9.1" data-path="monitor-overview.html">
            <a href="monitor-overview.html">
            
                    
                    概述
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9.2" data-path="jmx.html">
            <a href="jmx.html">
            
                    
                    JMX
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9.3" data-path="zookeeper.html">
            <a href="zookeeper.html">
            
                    
                    ZooKeeper
            </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.10" >
            
                <span>
            
                    
                    To be continued ...未完待续...
            </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="Ref.html">
            <a href="Ref.html">
            
                    
                    参考文献
            </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://book.comptechs.cn" target="_blank" class="gitbook-link"><strong>开源图书(OpenBooks)</strong></a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"概述","level":"1.6.1","depth":2,"next":{"title":"JMS","level":"1.6.2","depth":2,"path":"docs/jms.md","ref":"docs/jms.md","articles":[]},"previous":{"title":"基于消息的通信","level":"1.6","depth":1,"ref":"","articles":[{"title":"概述","level":"1.6.1","depth":2,"path":"docs/mq-overview.md","ref":"docs/mq-overview.md","articles":[]},{"title":"JMS","level":"1.6.2","depth":2,"path":"docs/jms.md","ref":"docs/jms.md","articles":[]},{"title":"ActiveMQ 示例","level":"1.6.3","depth":2,"path":"docs/actiovemq.md","ref":"docs/actiovemq.md","articles":[]},{"title":"其他","level":"1.6.4","depth":2,"path":"docs/mq-other.md","ref":"docs/mq-other.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":["theme-vmlite@git+https://github.com/vmlite/gitbook-plugin-theme-vmlite.git"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-vmlite":{"showLevel":false,"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"}},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"分布式 Java(Distributed Java)","language":"zh-hans","gitbook":"*"},"file":{"path":"docs/mq-overview.md","mtime":"2020-10-18T14:31:39.122Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-10-18T14:32:17.687Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="//cdn.jsdelivr.net/npm/gitbook-plugin-theme-default@1.0.7/_assets/website/gitbook.js"></script>
    <script src="//cdn.jsdelivr.net/npm/gitbook-plugin-theme-default@1.0.7/_assets/website/theme.js"></script>
    
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

        <script async src="https://www.googletagmanager.com/gtag/js?id=UA-152683495-1"></script>
        <script>
          window.dataLayer = window.dataLayer || [];
          function gtag(){dataLayer.push(arguments);}
          gtag('js', new Date());

          gtag('config', 'UA-152683495-1'); 
        var _hmt = _hmt || [];
        (function() {
          var hm = document.createElement("script");
          hm.src = "https://hm.baidu.com/hm.js?b6193f769a96b5f12f441649fc8d4e49";
          var s = document.getElementsByTagName("script")[0]; 
          s.parentNode.insertBefore(hm, s);
        })();
        </script>
    </body>
</html>

