
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <title>概述 - 分布式 Java(Distributed Java) - 开源图书(OpenBooks)</title>
        
        <meta name="description" content="">
        
        
        <script data-ad-client="ca-pub-9312750344484857" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
        
    
    <link rel="stylesheet" href="//cdn.jsdelivr.net/npm/gitbook-plugin-theme-default@1.0.7/_assets/website/style.css">

    
            
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="//cdn.jsdelivr.net/npm/gitbook-plugin-theme-default@1.0.7/_assets/website/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="//cdn.jsdelivr.net/npm/gitbook-plugin-theme-default@1.0.7/_assets/website/images/favicon.ico" type="image/x-icon">

    <link rel="next" href="socket.html" />
    

    </head>
    <body>
        
<div class="book">  
    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
	<a href="/" class="btn pull-left" aria-label="开源图书(OpenBooks)"><i class="fa fa-home"></i></a>
    

    <!-- Title -->
    <h1><i class="fa fa-circle-o-notch fa-spin"></i><a href=".." >概述</a></h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <ins class="adsbygoogle"
                                     style="display:block"
                                     data-ad-client="ca-pub-9312750344484857"
                                     data-ad-slot="2669241897"
                                     data-ad-format="auto"
                                     data-full-width-responsive="true"></ins>
                                <script>
                                     (adsbygoogle = window.adsbygoogle || []).push({});
                                </script>
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x6982;&#x8FF0;">&#x6982;&#x8FF0;</h1>
<h2 id="&#x7F51;&#x7EDC;&#x57FA;&#x7840;">&#x7F51;&#x7EDC;&#x57FA;&#x7840;</h2>
<p>&#x5728;&#x4E92;&#x8054;&#x7F51;&#x4E0A;&#x4E4B;&#x95F4;&#x7684;&#x901A;&#x4FE1;&#x4EA4;&#x6D41;&#xFF0C;&#x4E00;&#x822C;&#x662F;&#x57FA;&#x4E8E; TCP  (Transmission Control Protocol&#xFF0C;&#x4F20;&#x8F93;&#x63A7;&#x5236;&#x534F;&#x8BAE;) &#x6216;&#x8005; UDP (User Datagram Protocol&#xFF0C;&#x7528;&#x6237;&#x6570;&#x636E;&#x62A5;&#x534F;&#x8BAE;) &#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#xFF1A;</p>
<p><img src="../images/net-1netw.gif" alt=""></p>
<p>&#x7F16;&#x5199; Java &#x5E94;&#x7528;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x5173;&#x6CE8;&#x4E8E;&#x5E94;&#x7528;&#x5C42; &#xFF08;application layer&#xFF09;&#xFF0C;&#x800C;&#x4E0D;&#x7528;&#x5173;&#x5FC3; TCP &#x548C; UDP &#x6240;&#x5728;&#x7684;&#x4F20;&#x8F93;&#x5C42;&#x662F;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x7684;&#x3002;java.net &#x5305;&#x542B;&#x4E86;&#x4F60;&#x7F16;&#x7A0B;&#x6240;&#x9700;&#x7684;&#x7C7B;&#xFF0C;&#x8FD9;&#x4E9B;&#x7C7B;&#x662F;&#x4E0E;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x65E0;&#x5173;&#x7684;&#x3002;&#x6BD4;&#x5982; URL, URLConnection, Socket, &#x548C; ServerSocket &#x7C7B;&#x662F;&#x4F7F;&#x7528; TCP &#x8FDE;&#x63A5;&#x7F51;&#x7EDC;&#x7684;&#xFF0C; DatagramPacket, DatagramSocket, &#x548C; MulticastSocket &#x7C7B;&#x662F;&#x7528;&#x4E8E;  UDP  &#x7684;&#x3002;</p>
<p>Java &#x652F;&#x6301;&#x7684;&#x534F;&#x8BAE;&#x53EA;&#x6709;  TCP &#x548C; UDP &#xFF0C;&#x4EE5;&#x53CA;&#x5728;&#x5EFA;&#x7ACB;&#x5728;  TCP &#x548C; UDP &#x4E4B;&#x4E0A;&#x5176;&#x4ED6;&#x5E94;&#x7528;&#x5C42;&#x534F;&#x8BAE;&#x3002;&#x6240;&#x6709;&#x5176;&#x4ED6;&#x4F20;&#x8F93;&#x5C42;&#x3001;&#x7F51;&#x9645;&#x5C42;&#x548C;&#x66F4;&#x5E95;&#x5C42;&#x7684;&#x534F;&#x8BAE;&#xFF0C;&#x5982; ICMP&#x3001;IGMP&#x3001;ARP&#x3001;RARP&#x3001;RSVP &#x548C;&#x5176;&#x4ED6;&#x534F;&#x8BAE; &#x5728; Java &#x4E2D;&#x53EA;&#x80FD;&#x94FE;&#x63A5;&#x5230;&#x539F;&#x751F;&#x4EE3;&#x7801;&#x6765;&#x5B9E;&#x73B0;&#x3002;</p>
<h2 id="tcp">TCP</h2>
<p>TCP (Transmission Control Protocol) &#x662F;&#x9762;&#x5411;&#x8FDE;&#x63A5;&#x7684;&#x3001;&#x63D0;&#x4F9B;&#x7AEF;&#x5230;&#x7AEF;&#x53EF;&#x9760;&#x7684;&#x6570;&#x636E;&#x6D41;(flow of data)&#x3002;TCP &#x63D0;&#x4F9B;&#x8D85;&#x65F6;&#x91CD;&#x53D1;&#xFF0C;&#x4E22;&#x5F03;&#x91CD;&#x590D;&#x6570;&#x636E;&#xFF0C;&#x68C0;&#x9A8C;&#x6570;&#x636E;&#xFF0C;&#x6D41;&#x91CF;&#x63A7;&#x5236;&#x7B49;&#x529F;&#x80FD;&#xFF0C;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x80FD;&#x4ECE;&#x4E00;&#x7AEF;&#x4F20;&#x5230;&#x53E6;&#x4E00;&#x7AEF;&#x3002; </p>
<p>&#x201C;&#x9762;&#x5411;&#x8FDE;&#x63A5;&#x201D;&#x5C31;&#x662F;&#x5728;&#x6B63;&#x5F0F;&#x901A;&#x4FE1;&#x524D;&#x5FC5;&#x987B;&#x8981;&#x4E0E;&#x5BF9;&#x65B9;&#x5EFA;&#x7ACB;&#x8D77;&#x8FDE;&#x63A5;&#x3002;&#x8FD9;&#x4E00;&#x8FC7;&#x7A0B;&#x4E0E;&#x6253;&#x7535;&#x8BDD;&#x5F88;&#x76F8;&#x4F3C;&#xFF0C;&#x5148;&#x62E8;&#x53F7;&#x632F;&#x94C3;&#xFF0C;&#x7B49;&#x5F85;&#x5BF9;&#x65B9;&#x6458;&#x673A;&#x8BF4;&#x201C;&#x5582;&#x201D;&#xFF0C;&#x7136;&#x540E;&#x624D;&#x8BF4;&#x660E;&#x662F;&#x8C01;&#x3002;</p>
<h3 id="&#x4E09;&#x6B21;&#x63E1;&#x624B;">&#x4E09;&#x6B21;&#x63E1;&#x624B;</h3>
<p>TCP &#x662F;&#x57FA;&#x4E8E;&#x8FDE;&#x63A5;&#x7684;&#x534F;&#x8BAE;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5728;&#x6B63;&#x5F0F;&#x6536;&#x53D1;&#x6570;&#x636E;&#x524D;&#xFF0C;&#x5FC5;&#x987B;&#x548C;&#x5BF9;&#x65B9;&#x5EFA;&#x7ACB;&#x53EF;&#x9760;&#x7684;&#x8FDE;&#x63A5;&#x3002;&#x4E00;&#x4E2A; TCP &#x8FDE;&#x63A5;&#x5FC5;&#x987B;&#x8981;&#x7ECF;&#x8FC7;&#x4E09;&#x6B21;&#x201C;&#x63E1;&#x624B;&#x201D;&#x624D;&#x80FD;&#x5EFA;&#x7ACB;&#x8D77;&#x6765;&#xFF0C;&#x7B80;&#x5355;&#x7684;&#x8BB2;&#x5C31;&#x662F;&#xFF1A;</p>
<ol>
<li>&#x4E3B;&#x673A; A &#x5411;&#x4E3B;&#x673A; B &#x53D1;&#x51FA;&#x8FDE;&#x63A5;&#x8BF7;&#x6C42;&#x6570;&#x636E;&#x5305;&#xFF1A;&#x201C;&#x6211;&#x60F3;&#x7ED9;&#x4F60;&#x53D1;&#x6570;&#x636E;&#xFF0C;&#x53EF;&#x4EE5;&#x5417;&#xFF1F;&#x201D;&#xFF1B;</li>
<li>&#x4E3B;&#x673A; B &#x5411;&#x4E3B;&#x673A; A &#x53D1;&#x9001;&#x540C;&#x610F;&#x8FDE;&#x63A5;&#x548C;&#x8981;&#x6C42;&#x540C;&#x6B65;&#xFF08;&#x540C;&#x6B65;&#x5C31;&#x662F;&#x4E24;&#x53F0;&#x4E3B;&#x673A;&#x4E00;&#x4E2A;&#x5728;&#x53D1;&#x9001;&#xFF0C;&#x4E00;&#x4E2A;&#x5728;&#x63A5;&#x6536;&#xFF0C;&#x534F;&#x8C03;&#x5DE5;&#x4F5C;&#xFF09;&#x7684;&#x6570;&#x636E;&#x5305;&#xFF1A;&#x201C;&#x53EF;&#x4EE5;&#xFF0C;&#x4F60;&#x6765;&#x5427;&#x201D;&#xFF1B;</li>
<li>&#x4E3B;&#x673A; A &#x518D;&#x53D1;&#x51FA;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5305;&#x786E;&#x8BA4;&#x4E3B;&#x673A; B &#x7684;&#x8981;&#x6C42;&#x540C;&#x6B65;&#xFF1A;&#x201C;&#x597D;&#x7684;&#xFF0C;&#x6211;&#x6765;&#x4E5F;&#xFF0C;&#x4F60;&#x63A5;&#x7740;&#x5427;&#xFF01;&#x201D;</li>
</ol>
<p>&#x4E09;&#x6B21;&#x201C;&#x63E1;&#x624B;&#x201D;&#x7684;&#x76EE;&#x7684;&#x662F;&#x4F7F;&#x6570;&#x636E;&#x5305;&#x7684;&#x53D1;&#x9001;&#x548C;&#x63A5;&#x6536;&#x540C;&#x6B65;&#xFF0C;&#x7ECF;&#x8FC7;&#x4E09;&#x6B21;&#x201C;&#x5BF9;&#x8BDD;&#x201D;&#x4E4B;&#x540E;&#xFF0C;&#x4E3B;&#x673A; A &#x624D;&#x5411;&#x4E3B;&#x673A; B &#x6B63;&#x5F0F;&#x53D1;&#x9001;&#x6570;&#x636E;&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x8BE6;&#x89C1;&#x6211;&#x7684;&#x53E6;&#x5916;&#x4E00;&#x7BC7;&#x535A;&#x5BA2;<a href="https://waylau.com/tcp-connect-and-close/" target="_blank">&#x300A;TCP &#x534F;&#x8BAE;&#x7684;&#x4E09;&#x6B21;&#x63E1;&#x624B;&#x3001;&#x56DB;&#x6B21;&#x5206;&#x624B;&#x300B;</a>&#x3002;</p>
<h3 id="&#x5982;&#x4F55;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x7684;&#x53EF;&#x9760;">&#x5982;&#x4F55;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x7684;&#x53EF;&#x9760;</h3>
<p>TCP &#x901A;&#x8FC7;&#x4E0B;&#x5217;&#x65B9;&#x5F0F;&#x6765;&#x63D0;&#x4F9B;&#x53EF;&#x9760;&#x6027;&#xFF1A;</p>
<ul>
<li>&#x5E94;&#x7528;&#x6570;&#x636E;&#x88AB;&#x5206;&#x5272;&#x6210; TCP &#x8BA4;&#x4E3A;&#x6700;&#x9002;&#x5408;&#x53D1;&#x9001;&#x7684;&#x6570;&#x636E;&#x5757;&#x3002;&#x8FD9;&#x548C; UDP &#x5B8C;&#x5168;&#x4E0D;&#x540C;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EA7;&#x751F;&#x7684;&#x6570;&#x636E;&#x62A5;&#x957F;&#x5EA6;&#x5C06;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#x3002;&#x7531; TCP &#x4F20;&#x9012;&#x7ED9; IP &#x7684;&#x4FE1;&#x606F;&#x5355;&#x4F4D;&#x79F0;&#x4E3A;&#x62A5;&#x6587;&#x6BB5;&#x6216;&#x6BB5;&#xFF08;segment&#xFF09;&#x3002;</li>
<li>&#x5F53; TCP &#x53D1;&#x51FA;&#x4E00;&#x4E2A;&#x6BB5;&#x540E;&#xFF0C;&#x5B83;&#x542F;&#x52A8;&#x4E00;&#x4E2A;&#x5B9A;&#x65F6;&#x5668;&#xFF0C;&#x7B49;&#x5F85;&#x76EE;&#x7684;&#x7AEF;&#x786E;&#x8BA4;&#x6536;&#x5230;&#x8FD9;&#x4E2A;&#x62A5;&#x6587;&#x6BB5;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x80FD;&#x53CA;&#x65F6;&#x6536;&#x5230;&#x4E00;&#x4E2A;&#x786E;&#x8BA4;&#xFF0C;&#x5C06;&#x91CD;&#x53D1;&#x8FD9;&#x4E2A;&#x62A5;&#x6587;&#x6BB5;&#x3002;&#xFF08;&#x53EF;&#x81EA;&#x884C;&#x4E86;&#x89E3; TCP &#x534F;&#x8BAE;&#x4E2D;&#x81EA;&#x9002;&#x5E94;&#x7684;&#x8D85;&#x65F6;&#x53CA;&#x91CD;&#x4F20;&#x7B56;&#x7565;&#xFF09;&#x3002;</li>
<li>&#x5F53;  TCP &#x6536;&#x5230;&#x53D1;&#x81EA;  TCP &#x8FDE;&#x63A5;&#x53E6;&#x4E00;&#x7AEF;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5B83;&#x5C06;&#x53D1;&#x9001;&#x4E00;&#x4E2A;&#x786E;&#x8BA4;&#x3002;&#x8FD9;&#x4E2A;&#x786E;&#x8BA4;&#x4E0D;&#x662F;&#x7ACB;&#x5373;&#x53D1;&#x9001;&#xFF0C;&#x901A;&#x5E38;&#x5C06;&#x63A8;&#x8FDF;&#x51E0;&#x5206;&#x4E4B;&#x4E00;&#x79D2;&#x3002;</li>
<li>TCP &#x5C06;&#x4FDD;&#x6301;&#x5B83;&#x9996;&#x90E8;&#x548C;&#x6570;&#x636E;&#x7684;&#x68C0;&#x9A8C;&#x548C;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x7AEF;&#x5230;&#x7AEF;&#x7684;&#x68C0;&#x9A8C;&#x548C;&#xFF0C;&#x76EE;&#x7684;&#x662F;&#x68C0;&#x6D4B;&#x6570;&#x636E;&#x5728;&#x4F20;&#x8F93;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x53D8;&#x5316;&#x3002;&#x5982;&#x679C;&#x6536;&#x5230;&#x6BB5;&#x7684;&#x68C0;&#x9A8C;&#x548C;&#x6709;&#x5DEE;&#x9519;&#xFF0C;  TCP &#x5C06;&#x4E22;&#x5F03;&#x8FD9;&#x4E2A;&#x62A5;&#x6587;&#x6BB5;&#x548C;&#x4E0D;&#x786E;&#x8BA4;&#x6536;&#x5230;&#x6B64;&#x62A5;&#x6587;&#x6BB5;&#xFF08;&#x5E0C;&#x671B;&#x53D1;&#x9001;&#x7AEF;&#x8D85;&#x65F6;&#x5E76;&#x91CD;&#x53D1;&#xFF09;&#x3002;</li>
<li>&#x65E2;&#x7136; TCP &#x62A5;&#x6587;&#x6BB5;&#x4F5C;&#x4E3A; IP &#x6570;&#x636E;&#x62A5;&#x6765;&#x4F20;&#x8F93;&#xFF0C;&#x800C; IP &#x6570;&#x636E;&#x62A5;&#x7684;&#x5230;&#x8FBE;&#x53EF;&#x80FD;&#x4F1A;&#x5931;&#x5E8F;&#xFF0C;&#x56E0;&#x6B64;  TCP &#x62A5;&#x6587;&#x6BB5;&#x7684;&#x5230;&#x8FBE;&#x4E5F;&#x53EF;&#x80FD;&#x4F1A;&#x5931;&#x5E8F;&#x3002;&#x5982;&#x679C;&#x5FC5;&#x8981;&#xFF0C;  TCP &#x5C06;&#x5BF9;&#x6536;&#x5230;&#x7684;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x91CD;&#x65B0;&#x6392;&#x5E8F;&#xFF0C;&#x5C06;&#x6536;&#x5230;&#x7684;&#x6570;&#x636E;&#x4EE5;&#x6B63;&#x786E;&#x7684;&#x987A;&#x5E8F;&#x4EA4;&#x7ED9;&#x5E94;&#x7528;&#x5C42;&#x3002;</li>
<li>&#x65E2;&#x7136; IP &#x6570;&#x636E;&#x62A5;&#x4F1A;&#x53D1;&#x751F;&#x91CD;&#x590D;&#xFF0C;  TCP &#x7684;&#x63A5;&#x6536;&#x7AEF;&#x5FC5;&#x987B;&#x4E22;&#x5F03;&#x91CD;&#x590D;&#x7684;&#x6570;&#x636E;&#x3002;</li>
<li>TCP &#x8FD8;&#x80FD;&#x63D0;&#x4F9B;&#x6D41;&#x91CF;&#x63A7;&#x5236;&#x3002;TCP &#x8FDE;&#x63A5;&#x7684;&#x6BCF;&#x4E00;&#x65B9;&#x90FD;&#x6709;&#x56FA;&#x5B9A;&#x5927;&#x5C0F;&#x7684;&#x7F13;&#x51B2;&#x7A7A;&#x95F4;&#x3002; TCP &#x7684;&#x63A5;&#x6536;&#x7AEF;&#x53EA;&#x5141;&#x8BB8;&#x53E6;&#x4E00;&#x7AEF;&#x53D1;&#x9001;&#x63A5;&#x6536;&#x7AEF;&#x7F13;&#x51B2;&#x533A;&#x6240;&#x80FD;&#x63A5;&#x7EB3;&#x7684;&#x6570;&#x636E;&#x3002;&#x8FD9;&#x5C06;&#x9632;&#x6B62;&#x8F83;&#x5FEB;&#x4E3B;&#x673A;&#x81F4;&#x4F7F;&#x8F83;&#x6162;&#x4E3B;&#x673A;&#x7684;&#x7F13;&#x51B2;&#x533A;&#x6EA2;&#x51FA;&#x3002;</li>
</ul>
<h2 id="udp">UDP</h2>
<p>UDP (User Datagram Protocol) &#x4E0D;&#x662F;&#x9762;&#x5411;&#x8FDE;&#x63A5;&#x7684;&#xFF0C;&#x4E3B;&#x673A;&#x53D1;&#x9001;&#x72EC;&#x7ACB;&#x7684;&#x6570;&#x636E;&#x62A5;&#xFF08;datagram&#xFF09;&#x7ED9;&#x5176;&#x4ED6;&#x4E3B;&#x673A;&#xFF0C;&#x4E0D;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x5230;&#x8FBE;&#x3002;&#x7531;&#x4E8E; UDP &#x5728;&#x4F20;&#x8F93;&#x6570;&#x636E;&#x62A5;&#x524D;&#x4E0D;&#x7528;&#x5728;&#x5BA2;&#x6237;&#x548C;&#x670D;&#x52A1;&#x5668;&#x4E4B;&#x95F4;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x8FDE;&#x63A5;&#xFF0C;&#x4E14;&#x6CA1;&#x6709;&#x8D85;&#x65F6;&#x91CD;&#x53D1;&#x7B49;&#x673A;&#x5236;&#xFF0C;&#x6545;&#x800C;&#x4F20;&#x8F93;&#x901F;&#x5EA6;&#x5F88;&#x5FEB;&#x3002; </p>
<p>&#x800C;&#x65E0;&#x8FDE;&#x63A5;&#x662F;&#x4E00;&#x5F00;&#x59CB;&#x5C31;&#x53D1;&#x9001;&#x4FE1;&#x606F;&#xFF08;&#x4E25;&#x683C;&#x8BF4;&#x6765;&#xFF0C;&#x8FD9;&#x662F;&#x6CA1;&#x6709;&#x5F00;&#x59CB;&#x3001;&#x7ED3;&#x675F;&#x7684;&#xFF09;&#xFF0C;&#x53EA;&#x662F;&#x4E00;&#x6B21;&#x6027;&#x7684;&#x4F20;&#x9012;&#xFF0C;&#x662F;&#x5148;&#x4E0D;&#x9700;&#x8981;&#x63A5;&#x53D7;&#x65B9;&#x7684;&#x54CD;&#x5E94;&#xFF0C;&#x56E0;&#x800C;&#x5728;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x4E5F;&#x65E0;&#x6CD5;&#x4FDD;&#x8BC1;&#x4FE1;&#x606F;&#x4F20;&#x9012;&#x7684;&#x53EF;&#x9760;&#x6027;&#x4E86;&#xFF0C;&#x5C31;&#x50CF;&#x5199;&#x4FE1;&#x4E00;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x662F;&#x5C06;&#x4FE1;&#x5BC4;&#x51FA;&#x53BB;&#xFF0C;&#x5374;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x6536;&#x4FE1;&#x4EBA;&#x4E00;&#x5B9A;&#x53EF;&#x4EE5;&#x6536;&#x5230;&#x3002;</p>
<h3 id="tcp-&#x548C;-udp-&#x5982;&#x4F55;&#x6289;&#x62E9;">TCP &#x548C; UDP &#x5982;&#x4F55;&#x6289;&#x62E9;</h3>
<p>TCP &#x662F;&#x9762;&#x5411;&#x8FDE;&#x63A5;&#x7684;&#xFF0C;&#x6709;&#x6BD4;&#x8F83;&#x9AD8;&#x7684;&#x53EF;&#x9760;&#x6027;&#xFF0C; &#x4E00;&#x4E9B;&#x8981;&#x6C42;&#x6BD4;&#x8F83;&#x9AD8;&#x7684;&#x670D;&#x52A1;&#x4E00;&#x822C;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x534F;&#x8BAE;&#xFF0C;&#x5982;FTP&#x3001;Telnet&#x3001;SMTP&#x3001;HTTP&#x3001;POP3 &#x7B49;&#xFF0C;&#x800C; UDP &#x662F;&#x9762;&#x5411;&#x65E0;&#x8FDE;&#x63A5;&#x7684;&#xFF0C;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x534F;&#x8BAE;&#x7684;&#x5E38;&#x89C1;&#x670D;&#x52A1;&#x6709; DNS&#x3001;SNMP&#x3001;QQ &#x7B49;&#x3002;&#x5BF9;&#x4E8E; QQ &#x5FC5;&#x987B;&#x53E6;&#x5916;&#x8BF4;&#x660E;&#x4E00;&#x4E0B;&#xFF0C;QQ2003 &#x4EE5;&#x524D;&#x662F;&#x53EA;&#x4F7F;&#x7528;UDP&#x534F;&#x8BAE;&#x7684;&#xFF0C;&#x5176;&#x670D;&#x52A1;&#x5668;&#x4F7F;&#x7528;8000&#x7AEF;&#x53E3;&#xFF0C;&#x4FA6;&#x542C;&#x662F;&#x5426;&#x6709;&#x4FE1;&#x606F;&#x4F20;&#x6765;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x4F7F;&#x7528; 4000 &#x7AEF;&#x53E3;&#xFF0C;&#x5411;&#x5916;&#x53D1;&#x9001;&#x4FE1;&#x606F;&#xFF08;&#x8FD9;&#x4E5F;&#x5C31;&#x4E0D;&#x96BE;&#x7406;&#x89E3;&#x5728;&#x4E00;&#x822C;&#x7684;&#x663E;IP&#x7684;QQ&#x7248;&#x672C;&#x4E2D;&#x663E;&#x793A;&#x597D;&#x53CB;&#x7684;IP&#x5730;&#x5740;&#x4FE1;&#x606F;&#x4E2D;&#x7AEF;&#x53E3;&#x5E38;&#x4E3A;4000&#x6216;&#x5176;&#x540E;&#x7EED;&#x7AEF;&#x53E3;&#x7684;&#x539F;&#x56E0;&#x4E86;&#xFF09;&#xFF0C;&#x5373;QQ&#x7A0B;&#x5E8F;&#x65E2;&#x63A5;&#x53D7;&#x670D;&#x52A1;&#x53C8;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#xFF0C;&#x5728;&#x4EE5;&#x540E;&#x7684; QQ &#x7248;&#x672C;&#x4E2D;&#x4E5F;&#x652F;&#x6301;&#x4F7F;&#x7528; TCP &#x534F;&#x8BAE;&#x4E86;&#x3002;</p>
<h2 id="&#x7AEF;&#x53E3;">&#x7AEF;&#x53E3;</h2>
<p>&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x4E00;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x5177;&#x6709;&#x5355;&#x4E2A;&#x7269;&#x7406;&#x8FDE;&#x63A5;&#x5230;&#x7F51;&#x7EDC;&#x3002;&#x6570;&#x636E;&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x8FDE;&#x63A5;&#x53BB;&#x5F80;&#x7279;&#x5B9A;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8BE5;&#x6570;&#x636E;&#x53EF;&#x4EE5;&#x88AB;&#x7528;&#x4E8E;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x8FD0;&#x884C;&#x7684;&#x4E0D;&#x540C;&#x5E94;&#x7528;&#x3002;&#x90A3;&#x4E48;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x77E5;&#x9053;&#x54EA;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8F6C;&#x53D1;&#x6570;&#x636E;&#xFF1F;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x7AEF;&#x53E3;&#x3002;</p>
<p>&#x5728;&#x4E92;&#x8054;&#x7F51;&#x4E0A;&#x4F20;&#x8F93;&#x7684;&#x6570;&#x636E;&#x662F;&#x901A;&#x8FC7;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x6807;&#x8BC6;&#x548C;&#x7AEF;&#x53E3;&#x6765;&#x5B9A;&#x4F4D;&#x7684;&#x3002;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x6807;&#x8BC6;&#x662F; 32-bit  &#x7684; IP &#x5730;&#x5740;&#x3002;&#x7AEF;&#x53E3;&#x7531;&#x4E00;&#x4E2A; 16-bit &#x7684;&#x6570;&#x5B57;&#x3002;</p>
<p>&#x5728;&#x8BF8;&#x5982;&#x9762;&#x5411;&#x8FDE;&#x63A5;&#x7684;&#x901A;&#x4FE1;&#x5982; TCP&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x5E94;&#x7528;&#x5C06;&#x5957;&#x63A5;&#x5B57;&#x7ED1;&#x5B9A;&#x5230;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7AEF;&#x53E3;&#x53F7;&#x3002;&#x8FD9;&#x662F;&#x5411;&#x7CFB;&#x7EDF;&#x6CE8;&#x518C;&#x670D;&#x52A1;&#x7528;&#x6765;&#x63A5;&#x53D7;&#x8BE5;&#x7AEF;&#x53E3;&#x7684;&#x6570;&#x636E;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x53EF;&#x4EE5;&#x5728;&#x4E0E;&#x670D;&#x52A1;&#x5668;&#x5728;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x53E3;&#x4F1A;&#x5408;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="../images/net-2tcp.gif" alt=""></p>
<p>TCP &#x548C; UDP &#x534F;&#x8BAE;&#x4F7F;&#x7528;&#x7684;&#x7AEF;&#x53E3;&#x6765;&#x5C06;&#x63A5;&#x6536;&#x5230;&#x7684;&#x6570;&#x636E;&#x6620;&#x5C04;&#x5230;&#x4E00;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x8FD0;&#x884C;&#x7684;&#x8FDB;&#x7A0B;&#x3002;</p>
<p>&#x5728;&#x57FA;&#x4E8E;&#x6570;&#x636E;&#x62A5;&#x7684;&#x901A;&#x4FE1;&#xFF0C;&#x5982; UDP&#xFF0C;&#x6570;&#x636E;&#x62A5;&#x5305;&#x4E2D;&#x5305;&#x542B;&#x5B83;&#x7684;&#x76EE;&#x7684;&#x5730;&#x7684;&#x7AEF;&#x53E3;&#x53F7;&#xFF0C;&#x7136;&#x540E; UDP &#x5C06;&#x6570;&#x636E;&#x5305;&#x8DEF;&#x7531;&#x5230;&#x76F8;&#x5E94;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x5982;&#x672C;&#x56FE;&#x6240;&#x793A;&#x7684;&#x7AEF;&#x53E3;&#x53F7;&#xFF1A;</p>
<p><img src="../images/net-3tcpudp.gif" alt=""></p>
<p>&#x7AEF;&#x53E3;&#x53F7;&#x53D6;&#x503C;&#x8303;&#x56F4;&#x662F;&#x4ECE; 0 &#x5230; 65535 &#xFF08;16-bit &#x957F;&#x5EA6;&#xFF09;&#xFF0C;&#x5176;&#x4E2D;&#x8303;&#x56F4;&#x4ECE; 0 &#x5230; 1023 &#x662F;&#x53D7;&#x9650;&#x7684;&#xFF0C;&#x5B83;&#x4EEC;&#x662F;&#x88AB;&#x77E5;&#x540D;&#x7684;&#x670D;&#x52A1;&#x6240;&#x4FDD;&#x7559;&#x4F7F;&#x7528;&#xFF0C;&#x4F8B;&#x5982; HTTP &#xFF08;&#x7AEF;&#x53E3;&#x662F; 80&#xFF09;&#x548C; FTP &#xFF08;&#x7AEF;&#x53E3;&#x662F;20&#x3001;21&#xFF09;&#x7B49;&#x7CFB;&#x7EDF;&#x670D;&#x52A1;&#x3002;&#x8FD9;&#x4E9B;&#x7AEF;&#x53E3;&#x88AB;&#x79F0;&#x4E3A;&#x4F17;&#x6240;&#x5468;&#x77E5;&#x7684;&#x7AEF;&#x53E3;&#xFF08;well-known ports&#xFF09;&#x3002;&#x60A8;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E0D;&#x5E94;&#x8BE5;&#x8BD5;&#x56FE;&#x7ED1;&#x5B9A;&#x5230;&#x4ED6;&#x4EEC;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE; <a href="http://www.iana.org/assignments/service-names-port-numbers/service-names-port-numbers.xhtml" target="_blank">http://www.iana.org/assignments/service-names-port-numbers/service-names-port-numbers.xhtml</a> &#x6765;&#x67E5;&#x8BE2;&#x5404;&#x79CD;&#x5E38;&#x7528;&#x7684;&#x5DF2;&#x7ECF;&#x5206;&#x914D;&#x7684;&#x7AEF;&#x53E3;&#x53F7;&#x5217;&#x8868;&#x3002;</p>

                                
                                </section>
                                <ins class="adsbygoogle"
                                     style="display:block"
                                     data-ad-client="ca-pub-9312750344484857"
                                     data-ad-slot="2669241897"
                                     data-ad-format="auto"
                                     data-full-width-responsive="true"></ins>
                                <script>
                                     (adsbygoogle = window.adsbygoogle || []).push({});
                                </script>                                
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
                <a href="socket.html" class="navigation navigation-next navigation-unique" aria-label="下一页: Socket">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            <a href="../">
            
                    
                    简介
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="basic.html">
            <a href="basic.html">
            
                    
                    基础概念
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    通信原理
            </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="ipc.html">
            <a href="ipc.html">
            
                    
                    IPC
            </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    网络通信基础
            </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.4.1" data-path="net-overview.html">
            <a href="net-overview.html">
            
                    
                    概述
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="socket.html">
            <a href="socket.html">
            
                    
                    Socket
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="bio.html">
            <a href="bio.html">
            
                    
                    BIO
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="nio.html">
            <a href="nio.html">
            
                    
                    NIO
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.5" data-path="aio.html">
            <a href="aio.html">
            
                    
                    AIO
            </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" >
            
                <span>
            
                    
                    分布式对象 Java RMI
            </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="rmi-overview.html">
            <a href="rmi-overview.html">
            
                    
                    概述
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="architecture.html">
            <a href="architecture.html">
            
                    
                    架构
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3" data-path="api.html">
            <a href="api.html">
            
                    
                    常用接口
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.4" data-path="example.html">
            <a href="example.html">
            
                    
                    示例
            </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" >
            
                <span>
            
                    
                    基于消息的通信
            </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.6.1" data-path="mq-overview.html">
            <a href="mq-overview.html">
            
                    
                    概述
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.2" data-path="jms.html">
            <a href="jms.html">
            
                    
                    JMS
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.3" data-path="actiovemq.html">
            <a href="actiovemq.html">
            
                    
                    ActiveMQ 示例
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.4" data-path="mq-other.html">
            <a href="mq-other.html">
            
                    
                    其他
            </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.7" >
            
                <span>
            
                    
                    Web Services
            </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.7.1" data-path="web-overview.html">
            <a href="web-overview.html">
            
                    
                    概述
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.2" data-path="jax-ws.html">
            <a href="jax-ws.html">
            
                    
                    JAX-WS
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.3" data-path="rest.html">
            <a href="rest.html">
            
                    
                    RESTful 概述
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.4" data-path="jersey.html">
            <a href="jersey.html">
            
                    
                    基于 Jersey 的 JAX-RS 示例 
            </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.8" >
            
                <span>
            
                    
                    微服务
            </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.8.1" data-path="mas-overview.html">
            <a href="mas-overview.html">
            
                    
                    概述
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8.2" data-path="spring-boot.html">
            <a href="spring-boot.html">
            
                    
                    Spring Boot
            </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.9" >
            
                <span>
            
                    
                    监控
            </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.9.1" data-path="monitor-overview.html">
            <a href="monitor-overview.html">
            
                    
                    概述
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9.2" data-path="jmx.html">
            <a href="jmx.html">
            
                    
                    JMX
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9.3" data-path="zookeeper.html">
            <a href="zookeeper.html">
            
                    
                    ZooKeeper
            </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.10" >
            
                <span>
            
                    
                    To be continued ...未完待续...
            </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="Ref.html">
            <a href="Ref.html">
            
                    
                    参考文献
            </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://book.comptechs.cn" target="_blank" class="gitbook-link"><strong>开源图书(OpenBooks)</strong></a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"概述","level":"1.4.1","depth":2,"next":{"title":"Socket","level":"1.4.2","depth":2,"path":"docs/socket.md","ref":"docs/socket.md","articles":[]},"previous":{"title":"网络通信基础","level":"1.4","depth":1,"ref":"","articles":[{"title":"概述","level":"1.4.1","depth":2,"path":"docs/net-overview.md","ref":"docs/net-overview.md","articles":[]},{"title":"Socket","level":"1.4.2","depth":2,"path":"docs/socket.md","ref":"docs/socket.md","articles":[]},{"title":"BIO","level":"1.4.3","depth":2,"path":"docs/bio.md","ref":"docs/bio.md","articles":[]},{"title":"NIO","level":"1.4.4","depth":2,"path":"docs/nio.md","ref":"docs/nio.md","articles":[]},{"title":"AIO","level":"1.4.5","depth":2,"path":"docs/aio.md","ref":"docs/aio.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":["theme-vmlite@git+https://github.com/vmlite/gitbook-plugin-theme-vmlite.git"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-vmlite":{"showLevel":false,"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"}},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"分布式 Java(Distributed Java)","language":"zh-hans","gitbook":"*"},"file":{"path":"docs/net-overview.md","mtime":"2020-10-18T14:31:39.122Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-10-18T14:32:17.687Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="//cdn.jsdelivr.net/npm/gitbook-plugin-theme-default@1.0.7/_assets/website/gitbook.js"></script>
    <script src="//cdn.jsdelivr.net/npm/gitbook-plugin-theme-default@1.0.7/_assets/website/theme.js"></script>
    
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

        <script async src="https://www.googletagmanager.com/gtag/js?id=UA-152683495-1"></script>
        <script>
          window.dataLayer = window.dataLayer || [];
          function gtag(){dataLayer.push(arguments);}
          gtag('js', new Date());

          gtag('config', 'UA-152683495-1'); 
        var _hmt = _hmt || [];
        (function() {
          var hm = document.createElement("script");
          hm.src = "https://hm.baidu.com/hm.js?b6193f769a96b5f12f441649fc8d4e49";
          var s = document.getElementsByTagName("script")[0]; 
          s.parentNode.insertBefore(hm, s);
        })();
        </script>
    </body>
</html>

