
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <title>概述 - 分布式 Java(Distributed Java) - 开源图书(OpenBooks)</title>
        
        <meta name="description" content="">
        
        
        <script data-ad-client="ca-pub-9312750344484857" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
        
    
    <link rel="stylesheet" href="//cdn.jsdelivr.net/npm/gitbook-plugin-theme-default@1.0.7/_assets/website/style.css">

    
            
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="//cdn.jsdelivr.net/npm/gitbook-plugin-theme-default@1.0.7/_assets/website/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="//cdn.jsdelivr.net/npm/gitbook-plugin-theme-default@1.0.7/_assets/website/images/favicon.ico" type="image/x-icon">

    <link rel="next" href="architecture.html" />
    

    </head>
    <body>
        
<div class="book">  
    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
	<a href="/" class="btn pull-left" aria-label="开源图书(OpenBooks)"><i class="fa fa-home"></i></a>
    

    <!-- Title -->
    <h1><i class="fa fa-circle-o-notch fa-spin"></i><a href=".." >概述</a></h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <ins class="adsbygoogle"
                                     style="display:block"
                                     data-ad-client="ca-pub-9312750344484857"
                                     data-ad-slot="2669241897"
                                     data-ad-format="auto"
                                     data-full-width-responsive="true"></ins>
                                <script>
                                     (adsbygoogle = window.adsbygoogle || []).push({});
                                </script>
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x6982;&#x8FF0;">&#x6982;&#x8FF0;</h1>
<p>&#x5728;&#x57FA;&#x4E8E;&#x5BF9;&#x8C61;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x5BF9;&#x8C61;&#x7684;&#x6982;&#x5FF5;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x5B9E;&#x73B0;&#x4E2D;&#x8D77;&#x7740;&#x6781;&#x5176;&#x5173;&#x952E;&#x7684;&#x4F5C;&#x7528;&#x3002;&#x4ECE;&#x539F;&#x7406;&#x4E0A;&#x6765;&#x8BB2;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x4E00;&#x5207;&#x90FD;&#x88AB;&#x4F5C;&#x4E3A;&#x5BF9;&#x8C61;&#x62BD;&#x8C61;&#x51FA;&#x6765;&#xFF0C;&#x800C;&#x5BA2;&#x6237;&#x7AEF;&#x5C06;&#x4EE5;&#x8C03;&#x7528;&#x5BF9;&#x8C61;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x83B7;&#x5F97;&#x670D;&#x52A1;&#x548C;&#x8D44;&#x6E90;&#x3002;</p>
<p>&#x5206;&#x5E03;&#x5F0F;&#x5BF9;&#x8C61;&#x4E4B;&#x6240;&#x4EE5;&#x6210;&#x4E3A;&#x91CD;&#x8981;&#x7684;&#x8303;&#x578B;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x76F8;&#x5BF9;&#x6BD4;&#x8F83;&#x5BB9;&#x6613;&#x7684;&#x628A;&#x5206;&#x5E03;&#x7684;&#x7279;&#x6027;&#x9690;&#x85CF;&#x5728;&#x5BF9;&#x8C61;&#x63A5;&#x53E3;&#x540E;&#x9762;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x56E0;&#x4E3A;&#x5BF9;&#x8C61;&#x5B9E;&#x9645;&#x4E0A;&#x53EF;&#x4EE5;&#x662F;&#x4EFB;&#x4F55;&#x4E8B;&#x52A1;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x4E5F;&#x662F;&#x6784;&#x5EFA;&#x7CFB;&#x7EDF;&#x7684;&#x5F3A;&#x5927;&#x8303;&#x578B;&#x3002;</p>
<p>&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x6280;&#x672F;&#x4E8E;20&#x4E16;&#x7EAA;80&#x5E74;&#x4EE3;&#x5F00;&#x59CB;&#x7528;&#x4E8E;&#x5F00;&#x53D1;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x5728;&#x8FBE;&#x5230;&#x9AD8;&#x5EA6;&#x5206;&#x5E03;&#x5F0F;&#x900F;&#x660E;&#x6027;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x901A;&#x8FC7;&#x8FDC;&#x7A0B;&#x670D;&#x52A1;&#x5668;&#x5BBF;&#x4E3B;&#x72EC;&#x7ACB;&#x5BF9;&#x8C61;&#x7684;&#x7406;&#x5FF5;&#x6784;&#x6210;&#x4E86;&#x5F00;&#x53D1;&#x65B0;&#x4E00;&#x4EE3;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x7684;&#x7A33;&#x56FA;&#x7684;&#x57FA;&#x7840;&#x3002;&#x5728;&#x672C;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x770B;&#x5230;&#x57FA;&#x4E8E;&#x5BF9;&#x8C61;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x7684;&#x5E38;&#x7528;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x3002;</p>
<h2 id="&#x5206;&#x5E03;&#x5F0F;&#x5BF9;&#x8C61;">&#x5206;&#x5E03;&#x5F0F;&#x5BF9;&#x8C61;</h2>
<p>&#x8F6F;&#x4EF6;&#x4E16;&#x754C;&#x4E2D;&#x7684;&#x5BF9;&#x8C61;&#x548C;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x4E2D;&#x7684;&#x5BF9;&#x8C61;&#x7C7B;&#x4F3C;&#xFF0C;&#x5BF9;&#x8C61;&#x5B58;&#x50A8;&#x72B6;&#x6001;&#x5728;&#x5B57;&#x6BB5;&#xFF08;field&#xFF09;&#x91CC;&#xFF0C;&#x800C;&#x901A;&#x8FC7;&#x65B9;&#x6CD5;&#xFF08;methods&#xFF09;&#x66B4;&#x9732;&#x5176;&#x884C;&#x4E3A;&#x3002;&#x65B9;&#x6CD5;&#x5BF9;&#x5BF9;&#x8C61;&#x7684;&#x5185;&#x90E8;&#x72B6;&#x6001;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#xFF0C;&#x5E76;&#x4F5C;&#x4E3A;&#x5BF9;&#x8C61;&#x4E0E;&#x5BF9;&#x8C61;&#x4E4B;&#x95F4;&#x901A;&#x4FE1;&#x4E3B;&#x8981;&#x673A;&#x5236;&#x3002;&#x9690;&#x85CF;&#x5BF9;&#x8C61;&#x5185;&#x90E8;&#x72B6;&#x6001;&#xFF0C;&#x901A;&#x8FC7;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x6240;&#x6709;&#x7684;&#x4EA4;&#x4E92;&#xFF0C;&#x8FD9;&#x4E2A;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#x7684;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x539F;&#x5219;&#x2014;&#x2014;&#x6570;&#x636E;&#x5C01;&#x88C5;&#xFF08;data encapsulation&#xFF09;&#x3002;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x63A5;&#x53E3;&#xFF08;interface&#xFF09;&#x6765;&#x4F7F;&#x7528;&#x65B9;&#x6CD5;&#x3002;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x53EF;&#x80FD;&#x5B9E;&#x73B0;&#x591A;&#x4E2A;&#x63A5;&#x53E3;&#xFF0C;&#x800C;&#x7ED9;&#x5B9A;&#x7684;&#x4E00;&#x4E2A;&#x63A5;&#x53E3;&#x5B9A;&#x4E49;&#xFF0C;&#x53EF;&#x80FD;&#x6709;&#x591A;&#x4E2A;&#x5BF9;&#x8C61;&#x4E3A;&#x5176;&#x63D0;&#x4F9B;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x628A;&#x63A5;&#x53E3;&#x4E0E;&#x5B9E;&#x73B0;&#x8FD9;&#x4E9B;&#x63A5;&#x53E3;&#x7684;&#x5BF9;&#x8C61;&#x8FDB;&#x884C;&#x5206;&#x9694;&#x5F00;&#xFF0C;&#x5BF9;&#x4E8E;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x662F;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x7684;&#x3002;&#x4E25;&#x683C;&#x7684;&#x9694;&#x79BB;&#x5141;&#x8BB8;&#x6211;&#x4EEC;&#x628A;&#x63A5;&#x53E3;&#x653E;&#x5728;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#xFF0C;&#x800C;&#x4F7F;&#x5BF9;&#x8C61;&#x672C;&#x8EAB;&#x9A7B;&#x7559;&#x5728;&#x53E6;&#x5916;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#x3002;&#x8FD9;&#x79CD;&#x7EC4;&#x7EC7;&#x901A;&#x5E38;&#x79F0;&#x4E3A;&#x5206;&#x5E03;&#x5F0F;&#x5BF9;&#x8C61;&#xFF08;distributed object&#xFF09;&#x3002;</p>
<p><img src="../images/distributed-object.jpg" alt="&#x5E26;&#x6709;&#x5BA2;&#x6237;&#x7AEF;&#x4EE3;&#x7406;&#x7684;&#x8FDC;&#x7A0B;&#x5BF9;&#x8C61;&#x7684;&#x5E38;&#x89C1;&#x7EC4;&#x7EC7;"></p>
<p>&#xFF08;&#x6CE8;&#xFF1A;&#x8BE5;&#x56FE;&#x7247;&#x5F15;&#x7528;&#x81EA;&#x300A;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x539F;&#x7406;&#x4E0E;&#x8303;&#x5F0F;&#x300B;&#x4E00;&#x4E66;&#xFF09;</p>
<p>&#x5F53;&#x5BA2;&#x6237;&#x7ED1;&#x5B9A;&#xFF08;bind&#xFF09;&#x5230;&#x4E00;&#x4E2A;&#x5206;&#x5E03;&#x5F0F;&#x5BF9;&#x8C61;&#x65F6;&#xFF0C;&#x5C31;&#x4F1A;&#x628A;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x63A5;&#x53E3;&#x7684;&#x5B9E;&#x73B0;&#x2014;&#x2014;&#x79F0;&#x4E3A;&#x4EE3;&#x7406;&#xFF08;proxy&#xFF09;&#x2014;&#x2014;&#x52A0;&#x8F7D;&#x8FD1;&#x5BA2;&#x6237;&#x7684;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x4E2D;&#x3002;&#x4EE3;&#x7406;&#x7C7B;&#x4F3C;&#x4E8E; RPC &#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x5BA2;&#x6237;&#x5B58;&#x6839;&#xFF08;client stub&#xFF09;&#x3002;&#x5B83;&#x6240;&#x505A;&#x7684;&#x4E8B;&#xFF0C;&#x662F;&#x628A;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x7F16;&#x7EC4;&#x8FDB;&#x6D88;&#x606F;&#x4E2D;&#xFF0C;&#x4EE5;&#x53CA;&#x5BF9;&#x5E94;&#x7B54;&#x6D88;&#x606F;&#x8FDB;&#x884C;&#x89E3;&#x7EC4;&#xFF0C;&#x628A;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x7684;&#x7ED3;&#x679C;&#x8FD4;&#x56DE;&#x7ED9;&#x5BA2;&#x6237;&#x3002;&#x5B9E;&#x9645;&#x7684;&#x5BF9;&#x8C61;&#x9A7B;&#x7559;&#x5728;&#x670D;&#x52A1;&#x5668;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#xFF0C;&#x5B83;&#x5728;&#x8FD9;&#x91CC;&#x63D0;&#x4F9B;&#x4E86;&#x4E0E;&#x5B83;&#x5728;&#x5BA2;&#x6237;&#x673A;&#x4E0A;&#x63D0;&#x4F9B;&#x7684;&#x76F8;&#x540C;&#x7684;&#x63A5;&#x53E3;&#x3002;&#x8FDB;&#x5165;&#x7684;&#x8C03;&#x7528;&#x8BF7;&#x6C42;&#x9996;&#x5148;&#x88AB;&#x4F20;&#x9012;&#x7ED9;&#x670D;&#x52A1;&#x5668;&#x5B58;&#x6839;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x5B58;&#x6839;&#x5BF9;&#x5B83;&#x4EEC;&#x8FDB;&#x884C;&#x89E3;&#x7801;&#xFF0C;&#x5728;&#x670D;&#x52A1;&#x5668;&#x4E2D;&#x7684;&#x5BF9;&#x8C61;&#x63A5;&#x53E3;&#x4E0A;&#x8FDB;&#x884C;&#x65B9;&#x6CD5;&#x7684;&#x8C03;&#x7528;&#x3002;&#x670D;&#x52A1;&#x5668;&#x5B58;&#x6839;&#x8FD8;&#x8D1F;&#x8D23;&#x5BF9;&#x5E94;&#x7B54;&#x8FDB;&#x884C;&#x7F16;&#x7801;&#xFF0C;&#x5E76;&#x628A;&#x5E94;&#x7B54;&#x6D88;&#x606F;&#x8F6C;&#x53D1;&#x7ED9;&#x5BA2;&#x6237;&#x7AEF;&#x4EE3;&#x7406;&#x3002;</p>
<p>&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x5B58;&#x6839;&#x901A;&#x5E38;&#x88AB;&#x79F0;&#x4E3A;&#x9AA8;&#x67B6;&#xFF08;skeleton&#xFF09;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x63D0;&#x4F9B;&#x4E86;&#x660E;&#x786E;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5141;&#x8BB8;&#x670D;&#x52A1;&#x5668;&#x4E2D;&#x95F4;&#x4EF6;&#x6765;&#x8BBF;&#x95EE;&#x7528;&#x6237;&#x5B9A;&#x4E49;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5B83;&#x901A;&#x5E38;&#x4EE5;&#x7279;&#x5B9A;&#x4E8E;&#x8BED;&#x8A00;&#x7684;&#x7C7B;&#x7684;&#x5F62;&#x5F0F;&#x5305;&#x542B;&#x4E0D;&#x5B8C;&#x6574;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x9700;&#x8981;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x6765;&#x5BF9;&#x4E00;&#x6B65;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x7279;&#x6B8A;&#x5316;&#x5904;&#x7406;&#x3002;</p>
<p>&#x5927;&#x591A;&#x6570;&#x5206;&#x5E03;&#x5F0F;&#x5BF9;&#x8C61;&#x7684;&#x4E00;&#x4E2A;&#x7279;&#x6027;&#x662F;&#x5B83;&#x4EEC;&#x7684;&#x72B6;&#x6001;&#x4E0D;&#x662F;&#x5206;&#x5E03;&#x5F0F;&#x7684;&#x3002;&#x72B6;&#x6001;&#x9A7B;&#x7559;&#x5728;&#x5355;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#x3002;&#x5728;&#x5176;&#x4ED6;&#x673A;&#x5668;&#x4E0A;&#xFF0C;&#x667A;&#x80FD;&#x5730;&#x4F7F;&#x7528;&#x88AB;&#x5BF9;&#x8C61;&#x5B9E;&#x73B0;&#x7684;&#x63A5;&#x53E3;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x5BF9;&#x8C61;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;&#x8FDC;&#x7A0B;&#x5BF9;&#x8C61;&#xFF08;remote object&#xFF09;&#x3002;&#x5206;&#x5E03;&#x5F0F;&#x5BF9;&#x8C61;&#x7684;&#x72B6;&#x6001;&#x672C;&#x8EAB;&#x53EF;&#x80FD;&#x7269;&#x7406;&#x5730;&#x5206;&#x5E03;&#x5728;&#x591A;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x79CD;&#x5206;&#x5E03;&#x5BF9;&#x4E8E;&#x5BF9;&#x8C61;&#x63A5;&#x53E3;&#x80CC;&#x540E;&#x7684;&#x5BA2;&#x6237;&#x6765;&#x8BF4;&#x662F;&#x900F;&#x660E;&#x7684;&#x3002;</p>
<h2 id="java-rmi">Java RMI</h2>
<p>&#x76EE;&#x524D;&#xFF0C;&#x5E38;&#x7528;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x5BF9;&#x8C61;&#x5E38;&#x7528;&#x6280;&#x672F;&#x6709;&#x5FAE;&#x8F6F; DCOM&#xFF08;COM+&#xFF09;&#x3001;CORBA &#x4EE5;&#x53CA; Java RMI &#x7B49;&#x3002;</p>
<p>CORBA &#x65E8;&#x5728;&#x63D0;&#x4F9B;&#x4E00;&#x7EC4;&#x5168;&#x9762;&#x7684;&#x670D;&#x52A1;&#x6765;&#x7BA1;&#x7406;&#x5728;&#x5F02;&#x6784;&#x73AF;&#x5883;&#x4E2D;&#xFF08;&#x4E0D;&#x540C;&#x8BED;&#x8A00;&#x3001;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3001;&#x7F51;&#x7EDC;&#xFF09;&#x7684;&#x5BF9;&#x8C61;&#x3002;Java &#x5728;&#x5176;&#x6700;&#x521D;&#x53EA;&#x652F;&#x6301;&#x901A;&#x8FC7; socket &#x6765;&#x5B9E;&#x73B0;&#x5206;&#x5E03;&#x5F0F;&#x901A;&#x4FE1;&#x3002;1995&#x5E74;&#xFF0C;&#x4F5C;&#x4E3A; Java &#x7684;&#x7F14;&#x9020;&#x8005;&#xFF0C;Sun &#x516C;&#x53F8;&#x5F00;&#x59CB;&#x521B;&#x5EFA;&#x4E00;&#x4E2A; Java &#x7684;&#x6269;&#x5C55;&#xFF0C;&#x79F0;&#x4E3A; Java RMI&#xFF08;Remote Method Invocation&#xFF0C;&#x8FDC;&#x7A0B;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#xFF09;&#x3002;Java RMI &#x5141;&#x8BB8;&#x7A0B;&#x5E8F;&#x5458;&#x521B;&#x5EFA;&#x5206;&#x5E03;&#x5F0F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x4ECE;&#x5176;&#x4ED6; Java &#x865A;&#x62DF;&#x673A;&#xFF08;JVM&#xFF09;&#x8C03;&#x7528;&#x8FDC;&#x7A0B;&#x5BF9;&#x8C61;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x4E00;&#x65E6;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF08;&#x5BA2;&#x6237;&#x7AEF;&#xFF09;&#x5F15;&#x7528;&#x4E86;&#x8FDC;&#x7A0B;&#x5BF9;&#x8C61;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x8FDC;&#x7A0B;&#x8C03;&#x7528;&#x4E86;&#x3002;&#x8FD9;&#x662F;&#x901A;&#x8FC7; RMI &#x63D0;&#x4F9B;&#x7684;&#x547D;&#x540D;&#x670D;&#x52A1;&#xFF08;RMI &#x6CE8;&#x518C;&#x4E2D;&#x5FC3;&#xFF09;&#x6765;&#x67E5;&#x627E;&#x8FDC;&#x7A0B;&#x5BF9;&#x8C61;&#xFF0C;&#x6765;&#x63A5;&#x6536;&#x4F5C;&#x4E3A;&#x8FD4;&#x56DE;&#x503C;&#x7684;&#x5F15;&#x7528;&#x3002;Java RMI &#x5728;&#x6982;&#x5FF5;&#x4E0A;&#x7C7B;&#x4F3C;&#x4E8E; RPC&#xFF0C;&#x4F46;&#x80FD;&#x5728;&#x4E0D;&#x540C;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x652F;&#x6301;&#x5BF9;&#x8C61;&#x8C03;&#x7528;&#x7684;&#x8BED;&#x4E49;&#x3002;</p>
<p>&#x4E0E;&#x5927;&#x591A;&#x6570;&#x5176;&#x4ED6;&#x8BF8;&#x5982; CORBA &#x7684; RPC &#x7CFB;&#x7EDF;&#x4E0D;&#x540C;&#xFF0C;RMI &#x53EA;&#x652F;&#x6301;&#x57FA;&#x4E8E; Java &#x6765;&#x6784;&#x5EFA;&#xFF0C;&#x4F46;&#x4E5F;&#x6B63;&#x662F;&#x8FD9;&#x4E2A;&#x539F;&#x56E0;&#xFF0C; RMI &#x5BF9;&#x4E8E;&#x8BED;&#x8A00;&#x6765;&#x8BF4;&#x66F4;&#x52A0;&#x6574;&#x6D01;&#xFF0C;&#x65E0;&#x9700;&#x505A;&#x989D;&#x5916;&#x7684;&#x6570;&#x636E;&#x5E8F;&#x5217;&#x5316;&#x5DE5;&#x4F5C;&#x3002;Java RMI &#x7684;&#x8BBE;&#x8BA1;&#x76EE;&#x6807;&#x5E94;&#x8BE5;&#x662F;:</p>
<ul>
<li>&#x80FD;&#x591F;&#x9002;&#x5E94;&#x8BED;&#x8A00;&#x3001;&#x96C6;&#x6210;&#x5230;&#x8BED;&#x8A00;&#x3001;&#x6613;&#x4E8E;&#x4F7F;&#x7528;&#xFF1B;</li>
<li>&#x652F;&#x6301;&#x65E0;&#x7F1D;&#x7684;&#x8FDC;&#x7A0B;&#x8C03;&#x7528;&#x5BF9;&#x8C61;&#xFF1B;</li>
<li>&#x652F;&#x6301;&#x670D;&#x52A1;&#x5668;&#x5230; applet &#x7684;&#x56DE;&#x8C03;&#xFF1B;</li>
<li>&#x4FDD;&#x969C; Java &#x5BF9;&#x8C61;&#x7684;&#x5B89;&#x5168;&#x73AF;&#x5883;&#xFF1B;</li>
<li>&#x652F;&#x6301;&#x5206;&#x5E03;&#x5F0F;&#x5783;&#x573E;&#x56DE;&#x6536;&#xFF1B;</li>
<li>&#x652F;&#x6301;&#x591A;&#x79CD;&#x4F20;&#x8F93;&#x3002;</li>
</ul>
<p>&#x5206;&#x5E03;&#x5F0F;&#x5BF9;&#x8C61;&#x6A21;&#x578B;&#x4E0E;&#x672C;&#x5730; Java &#x5BF9;&#x8C61;&#x6A21;&#x578B;&#x76F8;&#x4F3C;&#x70B9;&#x5728;&#x4E8E;:</p>
<ul>
<li>&#x5F15;&#x7528;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x4F20;&#x9012;&#x6216;&#x4F5C;&#x4E3A;&#x8FD4;&#x56DE;&#x7684;&#x7ED3;&#x679C;&#xFF1B;</li>
<li>&#x8FDC;&#x7A0B;&#x5BF9;&#x8C61;&#x53EF;&#x4EE5;&#x6295;&#x5230;&#x4EFB;&#x4F55;&#x4F7F;&#x7528; Java &#x8BED;&#x6CD5;&#x5B9E;&#x73B0;&#x7684;&#x8FDC;&#x7A0B;&#x63A5;&#x53E3;&#x7684;&#x96C6;&#x5408;&#x4E0A;&#xFF1B;</li>
<li>&#x5185;&#x7F6E; Java instanceof &#x64CD;&#x4F5C;&#x7B26;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x6D4B;&#x8BD5;&#x8FDC;&#x7A0B;&#x5BF9;&#x8C61;&#x662F;&#x5426;&#x652F;&#x6301;&#x8FDC;&#x7A0B;&#x63A5;&#x53E3;&#x3002;</li>
</ul>
<p>&#x4E0D;&#x540C;&#x70B9;&#x5728;&#x4E8E;:</p>
<ul>
<li>&#x8FDC;&#x7A0B;&#x5BF9;&#x8C61;&#x7684;&#x7C7B;&#x662F;&#x4E0E;&#x8FDC;&#x7A0B;&#x63A5;&#x53E3;&#x8FDB;&#x884C;&#x4EA4;&#x4E92;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4E0E;&#x8FD9;&#x4E9B;&#x63A5;&#x53E3;&#x7684;&#x5B9E;&#x73B0;&#x7C7B;&#x4EA4;&#x4E92;&#xFF1B;</li>
<li>Non-remote &#x53C2;&#x6570;&#x5BF9;&#x4E8E;&#x8FDC;&#x7A0B;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x6765;&#x8BF4;&#x662F;&#x901A;&#x8FC7;&#x590D;&#x5236;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x901A;&#x8FC7;&#x5F15;&#x7528;&#xFF1B;</li>
<li>&#x8FDC;&#x7A0B;&#x5BF9;&#x8C61;&#x662F;&#x901A;&#x8FC7;&#x5F15;&#x7528;&#x6765;&#x4F20;&#x9012;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x590D;&#x5236;&#x5B9E;&#x9645;&#x7684;&#x8FDC;&#x7A0B;&#x5B9E;&#x73B0;&#xFF1B;</li>
<li>&#x5BA2;&#x6237;&#x7AEF;&#x5FC5;&#x987B;&#x5904;&#x7406;&#x989D;&#x5916;&#x7684;&#x5F02;&#x5E38;&#x3002;</li>
</ul>

                                
                                </section>
                                <ins class="adsbygoogle"
                                     style="display:block"
                                     data-ad-client="ca-pub-9312750344484857"
                                     data-ad-slot="2669241897"
                                     data-ad-format="auto"
                                     data-full-width-responsive="true"></ins>
                                <script>
                                     (adsbygoogle = window.adsbygoogle || []).push({});
                                </script>                                
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
                <a href="architecture.html" class="navigation navigation-next navigation-unique" aria-label="下一页: 架构">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            <a href="../">
            
                    
                    简介
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="basic.html">
            <a href="basic.html">
            
                    
                    基础概念
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    通信原理
            </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="ipc.html">
            <a href="ipc.html">
            
                    
                    IPC
            </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    网络通信基础
            </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="net-overview.html">
            <a href="net-overview.html">
            
                    
                    概述
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="socket.html">
            <a href="socket.html">
            
                    
                    Socket
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="bio.html">
            <a href="bio.html">
            
                    
                    BIO
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="nio.html">
            <a href="nio.html">
            
                    
                    NIO
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.5" data-path="aio.html">
            <a href="aio.html">
            
                    
                    AIO
            </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" >
            
                <span>
            
                    
                    分布式对象 Java RMI
            </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.5.1" data-path="rmi-overview.html">
            <a href="rmi-overview.html">
            
                    
                    概述
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="architecture.html">
            <a href="architecture.html">
            
                    
                    架构
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3" data-path="api.html">
            <a href="api.html">
            
                    
                    常用接口
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.4" data-path="example.html">
            <a href="example.html">
            
                    
                    示例
            </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" >
            
                <span>
            
                    
                    基于消息的通信
            </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.6.1" data-path="mq-overview.html">
            <a href="mq-overview.html">
            
                    
                    概述
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.2" data-path="jms.html">
            <a href="jms.html">
            
                    
                    JMS
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.3" data-path="actiovemq.html">
            <a href="actiovemq.html">
            
                    
                    ActiveMQ 示例
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.4" data-path="mq-other.html">
            <a href="mq-other.html">
            
                    
                    其他
            </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.7" >
            
                <span>
            
                    
                    Web Services
            </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.7.1" data-path="web-overview.html">
            <a href="web-overview.html">
            
                    
                    概述
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.2" data-path="jax-ws.html">
            <a href="jax-ws.html">
            
                    
                    JAX-WS
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.3" data-path="rest.html">
            <a href="rest.html">
            
                    
                    RESTful 概述
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.4" data-path="jersey.html">
            <a href="jersey.html">
            
                    
                    基于 Jersey 的 JAX-RS 示例 
            </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.8" >
            
                <span>
            
                    
                    微服务
            </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.8.1" data-path="mas-overview.html">
            <a href="mas-overview.html">
            
                    
                    概述
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8.2" data-path="spring-boot.html">
            <a href="spring-boot.html">
            
                    
                    Spring Boot
            </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.9" >
            
                <span>
            
                    
                    监控
            </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.9.1" data-path="monitor-overview.html">
            <a href="monitor-overview.html">
            
                    
                    概述
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9.2" data-path="jmx.html">
            <a href="jmx.html">
            
                    
                    JMX
            </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9.3" data-path="zookeeper.html">
            <a href="zookeeper.html">
            
                    
                    ZooKeeper
            </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.10" >
            
                <span>
            
                    
                    To be continued ...未完待续...
            </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="Ref.html">
            <a href="Ref.html">
            
                    
                    参考文献
            </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://book.comptechs.cn" target="_blank" class="gitbook-link"><strong>开源图书(OpenBooks)</strong></a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"概述","level":"1.5.1","depth":2,"next":{"title":"架构","level":"1.5.2","depth":2,"path":"docs/architecture.md","ref":"docs/architecture.md","articles":[]},"previous":{"title":"分布式对象 Java RMI","level":"1.5","depth":1,"ref":"","articles":[{"title":"概述","level":"1.5.1","depth":2,"path":"docs/rmi-overview.md","ref":"docs/rmi-overview.md","articles":[]},{"title":"架构","level":"1.5.2","depth":2,"path":"docs/architecture.md","ref":"docs/architecture.md","articles":[]},{"title":"常用接口","level":"1.5.3","depth":2,"path":"docs/api.md","ref":"docs/api.md","articles":[]},{"title":"示例","level":"1.5.4","depth":2,"path":"docs/example.md","ref":"docs/example.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":["theme-vmlite@git+https://github.com/vmlite/gitbook-plugin-theme-vmlite.git"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-vmlite":{"showLevel":false,"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"}},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"分布式 Java(Distributed Java)","language":"zh-hans","gitbook":"*"},"file":{"path":"docs/rmi-overview.md","mtime":"2020-10-18T14:31:39.122Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-10-18T14:32:17.687Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="//cdn.jsdelivr.net/npm/gitbook-plugin-theme-default@1.0.7/_assets/website/gitbook.js"></script>
    <script src="//cdn.jsdelivr.net/npm/gitbook-plugin-theme-default@1.0.7/_assets/website/theme.js"></script>
    
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

        <script async src="https://www.googletagmanager.com/gtag/js?id=UA-152683495-1"></script>
        <script>
          window.dataLayer = window.dataLayer || [];
          function gtag(){dataLayer.push(arguments);}
          gtag('js', new Date());

          gtag('config', 'UA-152683495-1'); 
        var _hmt = _hmt || [];
        (function() {
          var hm = document.createElement("script");
          hm.src = "https://hm.baidu.com/hm.js?b6193f769a96b5f12f441649fc8d4e49";
          var s = document.getElementsByTagName("script")[0]; 
          s.parentNode.insertBefore(hm, s);
        })();
        </script>
    </body>
</html>

